burnraging/raging/arm-projects/disco/src/nvm-stm32f4xx.c
/*
Copyright (c) 2019, Bernie Woodland
All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.
2. Redistributions in binary form must reproduce the above copyright notice,
   this list of conditions and the following disclaimer in the documentation
   and/or other materials provided with the distribution.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/

//! @file     nvm-stm32f4xx.c
//! @authors  Bernie Woodland
//! @date     11May19
//!
//! @brief    STM32F4xx series-specific FLASH programming interface
//!
//! @details  STM32F4XX-series flash programming interface. Guts copied from
//! @details  stm32f4xx_flash.c.
//! @details  This code is used for Bank0 operations only. It assumes that
//! @details  part is single-bank part, so actual write and erase routines
//! @details  are copied up to RAM and run there. Interrupts are locked when
//! @details  write and erases are happening, to prevent interrupt code from
//! @details  executing out of flash.
//! @details  Erases cannot be paused+resumed, so interrupts will be locked for
//! @details  a long time during erasures.


#include "raging-global.h"
#include "raging-contract.h"
#include "raging-utils-mem.h"

#include "stm32f4xx_flash.h"

#include "nvm-stm32f4xx.h"


//------------------ Local Defines  -------------------------

//#define FLASH_STATUS_OK(status)    ( (status) & (FLASH_FLAG_WRPERR | FLASH_FLAG_RDERR | (uint32_t)0xE0 | FLASH_FLAG_OPERR) )
#define FLASH_STATUS_OK(status)  ( ((status) & (                              \
                                  (uint32_t)FLASH_FLAG_RDERR  |               \
                                  (uint32_t)FLASH_FLAG_PGSERR |               \
                                  (uint32_t)FLASH_FLAG_PGPERR |               \
                                  (uint32_t)FLASH_FLAG_PGAERR |               \
                                  (uint32_t)FLASH_FLAG_WRPERR                 \
                                                )) == 0  )   

// Convert fcn ptrs to and from uint32_t's.
// Bit0/thumb mode is the problem: fcn ptr must have bit 0 set or will crash
#define VOID_PTR_TO_FCN_PTR(x)   ( (void *) ((uint32_t)(x) | 1) )
#define FCN_TO_VOID_PTR(x)       ( (void *) ((uint32_t)(&(x)) & 0xFFFFFFFE) )

// STM flash part does not allow copies across 64-bit boundary
#define  FLASH_PAGE_SIZE      8

// Copied from stm32f4xx_flash.c 
#define SECTOR_MASK               ((uint32_t)0xFFFFFF07)

//------------------ RAM reservation for write, erase fcns.  ------------------

// Fixed sized RAM buffers for RAM-resident write and erase fcns.
// Bit of a hack.
//
//               CAUTION!
// Both MAX_WRITE_FCN_SIZE_BYTES and MAX_ERASE_FCN_SIZE_BYTES
// values have been tuned by looking at disassembled length of
// stm_flash_write_doubleword_bank0 and stm_flash_erase_sector_bank0
// in debug build gdb session. An extra 20 bytes have been added for
// safety. If you add code to those fcns, then you must bump these
// values.
#define  MAX_WRITE_FCN_SIZE_BYTES   (108+20)
#define  MAX_WRITE_FCN_SIZE         (MAX_WRITE_FCN_SIZE_BYTES/BYTES_PER_WORD32)

#define  MAX_ERASE_FCN_SIZE_BYTES   (112+20)
#define  MAX_ERASE_FCN_SIZE         (MAX_ERASE_FCN_SIZE_BYTES/BYTES_PER_WORD32)
uint32_t stm_write_fcn_ram[MAX_WRITE_FCN_SIZE];
uint32_t stm_erase_fcn_ram[MAX_ERASE_FCN_SIZE];

//------------------ Function ptrs for RAM-resident ops  ----------------------

uint32_t (*stm_flash_write_byte_bank0_ptr)(uint32_t Address,
                                           uint8_t  Data,
                                           unsigned sector_number);
uint32_t (*stm_flash_write_halfword_bank0_ptr)(uint32_t Address,
                                               uint16_t Data,
                                               unsigned sector_number);
uint32_t (*stm_flash_write_word_bank0_ptr)(uint32_t Address,
                                           uint32_t Data,
                                           unsigned sector_number);
uint32_t (*stm_flash_write_doubleword_bank0_ptr)(uint32_t Address,
                                                 uint64_t Data,
                                                 unsigned sector_number);
uint32_t (*stm_flash_erase_bank0_ptr)(uint32_t sector_number, uint32_t psize);

//------------------ Local Variables  -----------------------------------------

bool    stm_unlocked;
uint8_t stm_voltage_level;

//------------------ Part-specific Info  ------------------
// From STM32f40x Reference Manual

// Bank Specific defines
#define STM_BASE_ADDRESS_BANK0       ((uint8_t *)0x8000000)
#define STM_BASE_ADDRESS_BANK1       ((uint8_t *)0x8100000)

// Either bank0 or bank1
#define STM_SIZE_BANK                 0x100000
#define STM_SIZE_DATA_SECTOR            0x4000
#define STM_SIZE_TEXT_SECTOR_FRONT      0x10000
#define STM_SIZE_TEXT_SECTOR_BACK       0x20000

// Layout of Either bank0 or bank1:
// index is sector number, value is starting offset
static const uint32_t stm_layout[] = {
    0*STM_SIZE_DATA_SECTOR,                                                              // 0
    1*STM_SIZE_DATA_SECTOR,                                                              // 1
    2*STM_SIZE_DATA_SECTOR,                                                              // 2
    3*STM_SIZE_DATA_SECTOR,                                                              // 3
    4*STM_SIZE_DATA_SECTOR + 0*STM_SIZE_TEXT_SECTOR_FRONT,                               // 4
    4*STM_SIZE_DATA_SECTOR + 1*STM_SIZE_TEXT_SECTOR_FRONT + 0*STM_SIZE_TEXT_SECTOR_BACK, // 5
    4*STM_SIZE_DATA_SECTOR + 1*STM_SIZE_TEXT_SECTOR_FRONT + 1*STM_SIZE_TEXT_SECTOR_BACK, // 6
    4*STM_SIZE_DATA_SECTOR + 1*STM_SIZE_TEXT_SECTOR_FRONT + 2*STM_SIZE_TEXT_SECTOR_BACK, // 7
    4*STM_SIZE_DATA_SECTOR + 1*STM_SIZE_TEXT_SECTOR_FRONT + 3*STM_SIZE_TEXT_SECTOR_BACK, // 8
    4*STM_SIZE_DATA_SECTOR + 1*STM_SIZE_TEXT_SECTOR_FRONT + 4*STM_SIZE_TEXT_SECTOR_BACK, // 9
    4*STM_SIZE_DATA_SECTOR + 1*STM_SIZE_TEXT_SECTOR_FRONT + 5*STM_SIZE_TEXT_SECTOR_BACK, //10
    4*STM_SIZE_DATA_SECTOR + 1*STM_SIZE_TEXT_SECTOR_FRONT + 6*STM_SIZE_TEXT_SECTOR_BACK  //11
};

