burnraging/raging/arm-projects/disco/src/nvm-stm32f4xx.c
//******************************************************************************
// Local Functions
//******************************************************************************

//!
//! @name      stm_interrupt_disable
//!
//! @brief     Full interrupt disable
//!
//! @details   NUFR uses the BASEPRI register to mask off interrupts,
//! @details   So PRIMASK should be not used. Using PRIMASK so that NO
//! @details   interrupts are enabled.
//!
//! @return    'true' if the add necessitates a context switch
//!
static void stm_interrupt_disable(void)
{
    __asm volatile(
        "  cpsid i      "                     // set bit 0 of PRIMASK
        : );
}

//!
//! @name      stm_interrupt_enable
//!
//! @brief     Inverse of disable
//!
static void stm_interrupt_enable(void)
{
    __asm volatile(
        "  cpsie i      "                     // clear bit 0 of PRIMASK
        : );
}

//!
//! @name      stm_are_interrupts_disabled
//!
//! @brief     Sanity check to ensure PRIMASK is not being used.
//!
//! @return    'true' if PRIMASK has interrupts disabled (not good)
//!
static bool __attribute__((naked)) stm_are_interrupts_disabled(void)
{
    __asm volatile(
        "  mrs    r0, primask\n\r"              // Move PRIMASK to r0/return
        "  and    r0, #1\n\r"                   // Mask out bits 31:1, leave 0
        "  bx     lr"
        : );

    return false;           // will never get here...supress compiler warning
}

//!
//! @name      stm_voltage_level_to_internal
//!
//! @brief     Type conversion from API voltage type to STM-type
//!
//! @return        'voltage'                Returns
//! @return    STM_FLASH_VOLTAGE_1      VoltageRange_1
//! @return    STM_FLASH_VOLTAGE_2      VoltageRange_2
//! @return    STM_FLASH_VOLTAGE_3      VoltageRange_3
//! @return    STM_FLASH_VOLTAGE_4      VoltageRange_4
//!
static uint8_t stm_voltage_level_to_internal(stm_flash_voltage_t voltage)
{
    uint8_t range;

    switch (voltage)
    {
    case STM_FLASH_VOLTAGE_1:
        range = VoltageRange_1;
        break;
    case STM_FLASH_VOLTAGE_2:
        range = VoltageRange_2;
        break;
    case STM_FLASH_VOLTAGE_3:
        range = VoltageRange_3;
        break;
    case STM_FLASH_VOLTAGE_4:
        range = VoltageRange_4;
        break;
    default:
        range = VoltageRange_1;
        APP_REQUIRE(false);
        break;
    }

    return range;
}

/**
  * @brief  Unlocks the FLASH control register access
  * @details Copied from 'FLASH_Unlock()' from STM code
  * @param  None
  * @retval None
  */
static void stm_flash_unlock(void)
{
    if ((FLASH->CR & FLASH_CR_LOCK) != RESET)
    {
        /* Authorize the FLASH Registers access */
        FLASH->KEYR = FLASH_KEY1;
        FLASH->KEYR = FLASH_KEY2;
    }  
}

//!
//! @name      stm_is_valid_address_bank0
//!
//! @brief     Sanity check
//!
//! @return    'true' if 'address' falls within range of bank0 flash address
//!
bool stm_is_valid_address_bank0(uint8_t *address)
{
    if ((address < STM_BASE_ADDRESS_BANK0) ||
        (address >= (STM_BASE_ADDRESS_BANK0 + STM_SIZE_BANK)))
    {
        return false;
    }

    return true;
}

//!
//! @name      stm_sector_number_to_address_bank0
//!
//! @brief     Sanity check
//!
//! @return    'true' if 'address' falls within range of bank0 flash address
//!
uint8_t *stm_sector_number_to_address_bank0(unsigned sector_number)
{
    // Sanity check
    if (sector_number >= ARRAY_SIZE(stm_layout))
    {
        return (uint8_t *)0xFFFFFFFF;
    }

    return STM_BASE_ADDRESS_BANK0 + stm_layout[sector_number];
}

//!
//! @name      stm_address_to_sector_number
//!
//! @brief     Sanity check
//!
//! @return    'true' if 'address' falls within range of bank0 flash address
//!
unsigned stm_address_to_sector_number(uint8_t *address)
{
    uint32_t offset;
    unsigned sector_number;
    const unsigned START_64k_SECTORS = 4;
    const unsigned START_128k_SECTORS = 5;

    if (stm_is_valid_address_bank0(address))
    {
        offset = address - STM_BASE_ADDRESS_BANK0;
    }
    else
    {
        offset = 0;         // make compiler happy
        return 0xFFFFFFFF;
    }

    if (offset < stm_layout[START_64k_SECTORS])
    {
        sector_number = offset / STM_SIZE_DATA_SECTOR;
    }
    else if (offset < stm_layout[START_128k_SECTORS])
    {
        sector_number = START_64k_SECTORS;
    }
    else
    {
        offset -= stm_layout[START_128k_SECTORS];
        sector_number = START_128k_SECTORS;
        sector_number += offset / STM_SIZE_TEXT_SECTOR_BACK;
    }

    return sector_number;
}

//!
//! @name      stm_voltage_level_to_psize
//!
//! @brief     Type conversion of voltage type to register bit field
//!
//! @return    
//! @return    FLASH_PSIZE_BYTE         (for VoltageRange_1 settings)
//! @return    FLASH_PSIZE_HALF_WORD    (for VoltageRange_2 settings or lower)
//! @return    FLASH_PSIZE_WORD         (for VoltageRange_3 settings or lower)
//! @return    FLASH_PSIZE_DOUBLE_WORD  (for VoltageRange_4 settings or lower)
//!
unsigned stm_voltage_level_to_psize(uint8_t voltage)
{
    unsigned psize;

    switch (voltage)
    {
    case VoltageRange_1:
        psize = FLASH_PSIZE_BYTE;
        break;
    case VoltageRange_2:
        psize = FLASH_PSIZE_HALF_WORD;
        break;
    case VoltageRange_3:
        psize = FLASH_PSIZE_WORD;
        break;
    case VoltageRange_4:
        psize = FLASH_PSIZE_DOUBLE_WORD;
        break;
    default:
        psize = 0;
        APP_REQUIRE(false);
        break;
    }

    return psize;
}

//!
//! @name      stm_flash_write_byte_bank0
//!
//! @brief     Single byte flash write
//!
//! @details   CAUTION note for MAX_WRITE_FCN_SIZE_BYTES applies here!
//!
//! @return    Register FLASH_SR contents
//!
uint32_t stm_flash_write_byte_bank0(uint32_t Address,
                                    uint8_t  Data,
                                    unsigned sector_number)
{
    uint32_t status_reg;
    uint32_t cr;

    cr = FLASH->CR;
    cr &= (CR_PSIZE_MASK & SECTOR_MASK);
    cr |= (FLASH_PSIZE_BYTE | FLASH_CR_PG | sector_number);
    FLASH->CR = cr;

    *(__IO uint8_t *)Address = Data;

    // Poll register until complete. Takes around 16 usecs.
    status_reg = FLASH->SR;
    while ((status_reg & FLASH_FLAG_BSY) != 0)
    {
        status_reg = FLASH->SR;
    }

