burnraging/raging/arm-projects/disco/src/nvm-stm32f4xx.c
    /* if the program operation is completed, disable the PG Bit */
    cr &= (~FLASH_CR_PG);
    FLASH->CR = cr;

    return status_reg;
}

//!
//! @name      stm_flash_write_halfword_bank0
//!
//! @brief     2-byte flash write
//!
//! @details   Can only be used for voltage >= VoltageRange_2
//! @details   CAUTION note for MAX_WRITE_FCN_SIZE_BYTES applies here!
//!
//! @param[in] 'Address'-- cannot cross program page (64-bit) boundary
//! @param[in] 'Data'-- 16-bit value to write. Little-endian write:
//! @param[in]    bits 0:7 at 'Address', bits 8:15 at 'Address'+1
//!
//! @return    Register FLASH_SR contents
//!
uint32_t stm_flash_write_halfword_bank0(uint32_t Address,
                                        uint16_t Data,
                                        unsigned sector_number)
{
    uint32_t status_reg;
    uint32_t cr;

    cr = FLASH->CR;
    cr &= (CR_PSIZE_MASK & SECTOR_MASK);
    cr |= (FLASH_PSIZE_HALF_WORD | FLASH_CR_PG | sector_number);
    FLASH->CR = cr;

    *(__IO uint16_t *)Address = Data;

    // Poll register until complete. Takes around 16 usecs.
    status_reg = FLASH->SR;
    while ((status_reg & FLASH_FLAG_BSY) != 0)
    {
        status_reg = FLASH->SR;
    }

    /* if the program operation is completed, disable the PG Bit */
    cr &= (~FLASH_CR_PG);
    FLASH->CR = cr;

    return status_reg;
}

//!
//! @name      stm_flash_write_word_bank0
//!
//! @brief     4-byte flash write
//!
//! @details   Can only be used for voltage >= VoltageRange_3
//! @details   CAUTION note for MAX_WRITE_FCN_SIZE_BYTES applies here!
//!
//! @param[in] 'Address'-- cannot cross program page (64-bit) boundary
//! @param[in] 'Data'-- 32-bit value to write. Little-endian write:
//! @param[in]    bits 0:7 at 'Address', bits 31:24 at 'Address'+3
//!
//! @return    Register FLASH_SR contents
//!
uint32_t stm_flash_write_word_bank0(uint32_t Address,
                                    uint32_t Data,
                                    unsigned sector_number)
{
    uint32_t status_reg;
    uint32_t cr;

    cr = FLASH->CR;
    cr &= (CR_PSIZE_MASK & SECTOR_MASK);
    cr |= (FLASH_PSIZE_WORD | FLASH_CR_PG | sector_number);
    FLASH->CR = cr;

    *(__IO uint32_t *)Address = Data;

    // Poll register until complete. Takes around 16 usecs.
    status_reg = FLASH->SR;
    while ((status_reg & FLASH_FLAG_BSY) != 0)
    {
        status_reg = FLASH->SR;
    }

    /* if the program operation is completed, disable the PG Bit */
    cr &= (~FLASH_CR_PG);
    FLASH->CR = cr;

    return status_reg;
}

//!
//! @name      stm_flash_write_doubleword_bank0
//!
//! @brief     8-byte flash write
//!
//! @details   Can only be used for voltage == VoltageRange_4
//! @details   CAUTION note for MAX_WRITE_FCN_SIZE_BYTES applies here!
//!
//! @param[in] 'Address'-- must be aligned to a program page (64-bit)
//! @param[in] 'Data'-- 64-bit value to write. Little-endian write:
//! @param[in]    bits 0:7 at 'Address', bits 63:56 at 'Address'+7
//! @param[in] 'sector_number'-- value of 0-11
//!
//! @return    Register FLASH_SR contents
//!
uint32_t stm_flash_write_doubleword_bank0(uint32_t Address,
                                          uint64_t Data,
                                          unsigned sector_number)
{
    uint32_t status_reg;
    uint32_t cr;

    cr = FLASH->CR;
    cr &= (CR_PSIZE_MASK & SECTOR_MASK);
    cr |= (FLASH_PSIZE_DOUBLE_WORD | FLASH_CR_PG | sector_number);
    FLASH->CR = cr;

    *(__IO uint64_t *)Address = Data;

    // Poll register until complete. Takes around 16 usecs.
    status_reg = FLASH->SR;
    while ((status_reg & FLASH_FLAG_BSY) != 0)
    {
        status_reg = FLASH->SR;
    }

    /* if the program operation is completed, disable the PG Bit */
    cr &= (~FLASH_CR_PG);
    FLASH->CR = cr;

    return status_reg;
}

//!
//! @name      stm_flash_erase_sector_bank0
//!
//! @brief     4-byte flash write
//!
//! @details   
//! @details   CAUTION note for MAX_ERASE_FCN_SIZE_BYTES applies here!
//!
//! @param[in] 'sector_number'-- 0, 1, 2, ...
//! @param[in]        0 is first 16k sector
//! @param[in] 'psize'-- current voltage.
//! @param[in]       'psize' value                  used when...
//! @param[in]    FLASH_PSIZE_BYTE         (for VoltageRange_1 settings)
//! @param[in]    FLASH_PSIZE_HALF_WORD    (for VoltageRange_2 settings or lower)
//! @param[in]    FLASH_PSIZE_WORD         (for VoltageRange_3 settings or lower)
//! @param[in]    FLASH_PSIZE_DOUBLE_WORD  (for VoltageRange_4 settings or lower)
//!
//! @return    Register FLASH_SR contents
//!
uint32_t stm_flash_erase_sector_bank0(uint32_t sector_number, uint32_t psize)
{
    uint32_t status_reg;
    uint32_t cr;

    cr = FLASH->CR;
    cr &= (CR_PSIZE_MASK & SECTOR_MASK);
    cr |= (FLASH_CR_SER | FLASH_CR_STRT | psize | sector_number);
    FLASH->CR = cr;

    // Poll until complete. For a 16k sector, takes around 400 millisecs
    status_reg = FLASH->SR;
    while ((status_reg & FLASH_FLAG_BSY) != 0)
    {
        status_reg = FLASH->SR;
    }

    /* if the erase operation is completed, disable the SER Bit */
    cr = FLASH->CR;
    cr &= (BITWISE_NOT32(FLASH_CR_SER) & SECTOR_MASK);
    FLASH->CR = cr;

    return status_reg;
}

//!
//! @name      stm_flash_page_write_bank0
//!
//! @brief     Write up to 1 flash page worth of data.
//!
//! @details   This fcn. figures out how much can be written, and
//! @details   this is based on alignment of 'address'
//! @details   and number of bytes to be written. It uses
//! @details   address to determine page, then writes
//! @details   all bytes it can fit into that page.
//! @details   Depending on voltage chip is running at, all
//! @details   writes will be at widest bit possible.
//!
//! @param[in] 'address'-- flash address to start write at
//! @param[in] 'data'-- byte array of data to write
//! @param[in] 'length_up_to'-- ideally write this many bytes
//! @param[in]         but expect that we won't be able to
//! @param[out] 'bytes_written_ptr'-- actual num. bytes written
//! @param[in] 'voltage'-- voltage that chip is set to. One of:
//! @param[in]              VoltageRange_1, VoltageRange_2,
//! @param[in]              VoltageRange_3, VoltageRange_4
//!
//! @return    STM_FLASH_SUCCESS or STM_FLASH_FAILURE
//!
stm_flash_status_t stm_flash_page_write_bank0(uint8_t  *address,
                                              uint8_t  *data,
                                              unsigned  length_up_to,
                                              unsigned *bytes_written_ptr,
                                  stm_flash_voltage_t   voltage)
{
    uint8_t     *base_address;
       // Defining 'shadow' and 'set_to" as uint32_t's forces alignment
    uint32_t     shadow[FLASH_PAGE_SIZE/BYTES_PER_WORD32];
    uint32_t     set_to[FLASH_PAGE_SIZE/BYTES_PER_WORD32];
    unsigned     align_offset;
    unsigned     page_remaining_length;
    unsigned     curtailed_length;
    unsigned     i;
    unsigned     sector_number;
    uint32_t     status_reg;

    if (0 == length_up_to)
    {
        *bytes_written_ptr = 0;
        return STM_FLASH_SUCCESS;
    }

    if (!stm_is_valid_address_bank0(address))
    {
        *bytes_written_ptr = 0;
        return STM_FLASH_FAILURE;
    }

