burnraging/raging/arm-projects/disco/src/nvm-stm32f4xx.c
    base_address = (uint8_t *)ALIGN64(address);

    // 'shadow' is pre-write contents of page
    // init 'set_to' to pre-write page bytes
    shadow[0] = ((uint32_t *)base_address)[0];
    set_to[0] = shadow[0];
    shadow[1] = ((uint32_t *)base_address)[1];
    set_to[1] = shadow[1];

    align_offset = (uint32_t)(address - base_address);
    page_remaining_length = FLASH_PAGE_SIZE - align_offset;

    // 'curtailed_length' is number of bytes that we can
    // write on 1 page.
    if (page_remaining_length <= length_up_to)
    {
        curtailed_length = page_remaining_length;
    }
    else
    {
        curtailed_length = length_up_to;
    }

    // 'set_to' is view of page contents after write
    // poke bytes to be written, leave other as it is
    rutils_memcpy( &((uint8_t *)set_to)[align_offset], data, curtailed_length);

    // From API's point of view, we're writing 'curtailed_length' bytes
    *bytes_written_ptr = curtailed_length;

    // If the flash op causes no change, then no need to do it
    if ((shadow[0] == set_to[0]) && (shadow[1] == set_to[1]))
    {
        return STM_FLASH_SUCCESS;
    }

    sector_number = stm_address_to_sector_number(base_address);

    // With 'STM_FLASH_VOLTAGE_1', only byte writes are allowed.
    // With 'STM_FLASH_VOLTAGE_2', both byte and halfword writes are allowed,
    //     but to make things simpler, just be halfwords, no bytes
    // Same for other ranges

    if (STM_FLASH_VOLTAGE_1 == voltage)
    {
        APP_REQUIRE(NULL != stm_flash_write_byte_bank0_ptr);

        for (i = 0; i < FLASH_PAGE_SIZE; i++)
        {
            // Case where we didn't poke into 'set_to' with
            //    write data.
            if (((uint8_t *)shadow)[i] != ((uint8_t *)set_to)[i])
            {
                // Since code is running out of bank 0, same
                // bank we're changing flash on, we can't
                // do code fetches while writing. Disable
                // interrupts to enforce this, then call
                // a fcn. which lives in ram.

                stm_interrupt_disable();

                status_reg = (*stm_flash_write_byte_bank0_ptr)(
                                                   (uint32_t)&base_address[i],
                                                   ((uint8_t *)set_to)[i],
                                                   sector_number);

                stm_interrupt_enable();

                if (!FLASH_STATUS_OK(status_reg))
                {
                    APP_ENSURE(false);
                    return STM_FLASH_FAILURE;
                }
            }
        }
    }

    else if (STM_FLASH_VOLTAGE_2 == voltage)
    {
        APP_REQUIRE(NULL != stm_flash_write_halfword_bank0_ptr);

        for (i = 0; i < FLASH_PAGE_SIZE/BYTES_PER_WORD16; i++)
        {
            if (((uint16_t *)shadow)[i] != ((uint16_t *)set_to)[i])
            {
                stm_interrupt_disable();

                status_reg = (*stm_flash_write_halfword_bank0_ptr)(
                                             (uint32_t)&base_address[i*sizeof(uint16_t)],
                                             ((uint16_t *)set_to)[i],
                                             sector_number);
                stm_interrupt_enable();

                if (!FLASH_STATUS_OK(status_reg))
                {
                    APP_ENSURE(false);
                    return STM_FLASH_FAILURE;
                }
            }
        }
    }

    else if (STM_FLASH_VOLTAGE_3 == voltage)
    {
        APP_REQUIRE(NULL != stm_flash_write_word_bank0_ptr);

        for (i = 0; i < FLASH_PAGE_SIZE/BYTES_PER_WORD32; i++)
        {
            if (shadow[i] != set_to[i])
            {
                stm_interrupt_disable();

                status_reg = (*stm_flash_write_word_bank0_ptr)(
                                             (uint32_t)&base_address[i*sizeof(uint32_t)],
                                             set_to[i],
                                             sector_number);
                stm_interrupt_enable();

                if (!FLASH_STATUS_OK(status_reg))
                {
                    APP_ENSURE(false);
                    return STM_FLASH_FAILURE;
                }
            }
        }
    }

    else if (STM_FLASH_VOLTAGE_4 == voltage)
    {
        APP_REQUIRE(NULL != stm_flash_write_doubleword_bank0_ptr);

        stm_interrupt_disable();

// gcc doesn't like casting of "*(uint64_t *)set_to" 
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wstrict-aliasing"
        status_reg = (*stm_flash_write_doubleword_bank0_ptr)(
                                         (uint32_t)base_address,
                                         *(uint64_t *)set_to,
                                         sector_number);
#pragma GCC diagnostic pop

        stm_interrupt_enable();

        if (!FLASH_STATUS_OK(status_reg))
        {
            APP_ENSURE(false);
            return STM_FLASH_FAILURE;
        }
    }

    // Illegal 'voltage' parm
    else
    {
        APP_REQUIRE(false);
        return STM_FLASH_FAILURE;
    }

    // Reload 'shadow' with newly written data
    shadow[0] = ((uint32_t *)base_address)[0];
    shadow[1] = ((uint32_t *)base_address)[1];

    // Verify that new contents are as expected
    if ((shadow[0] != set_to[0]) ||  (shadow[1] != set_to[1]))
    {
        return STM_FLASH_FAILURE;
    }

    return STM_FLASH_SUCCESS;
}

//******************************************************************************
// APIs
//******************************************************************************

//!
//! @name      stm_flash_init
//!
//! @brief     Init this module. Must call (once) before using.
//!
//! @details   Establishes voltage level settings.
//! @details   Copies write, erase fcns. from flash to RAM.
//!
//! @param[in] 'voltage_level'-- Voltage chip is running at.
//! @param[in]    NOTE: 
//!
void stm_flash_init(stm_flash_voltage_t voltage_level)
{
    stm_voltage_level = stm_voltage_level_to_internal(voltage_level);

    stm_unlocked = false;

    // If running single banked flash, need to copy all of the FLASH_
    // fcns. to ram, so we can execute out of there

