burnraging/raging/arm-projects/disco/src/nvm-stm32f4xx.c
    // Initialize fcn. pointers
    stm_flash_write_byte_bank0_ptr = NULL;
    stm_flash_write_halfword_bank0_ptr = NULL;
    stm_flash_write_word_bank0_ptr = NULL;
    stm_flash_write_doubleword_bank0_ptr = NULL;

    stm_flash_erase_bank0_ptr = VOID_PTR_TO_FCN_PTR(stm_erase_fcn_ram);

    // Copy fcns. up into ram.
    // So what if we copy too much?
    if (STM_FLASH_VOLTAGE_1 == voltage_level)
    {
        rutils_memcpy(&stm_write_fcn_ram,
                      FCN_TO_VOID_PTR(stm_flash_write_byte_bank0),
                      MAX_WRITE_FCN_SIZE_BYTES);
        stm_flash_write_byte_bank0_ptr = VOID_PTR_TO_FCN_PTR(stm_write_fcn_ram);
    }
    else if (STM_FLASH_VOLTAGE_2 == voltage_level)
    {
        rutils_memcpy(&stm_write_fcn_ram,
                      FCN_TO_VOID_PTR(stm_flash_write_halfword_bank0),
                      MAX_WRITE_FCN_SIZE_BYTES);
        stm_flash_write_halfword_bank0_ptr = VOID_PTR_TO_FCN_PTR(stm_write_fcn_ram);
    }
    else if (STM_FLASH_VOLTAGE_3 == voltage_level)
    {
        rutils_memcpy(&stm_write_fcn_ram,
                      FCN_TO_VOID_PTR(stm_flash_write_word_bank0),
                      MAX_WRITE_FCN_SIZE_BYTES);
        stm_flash_write_word_bank0_ptr = VOID_PTR_TO_FCN_PTR(stm_write_fcn_ram);
    }
    else if (STM_FLASH_VOLTAGE_4 == voltage_level)
    {
        rutils_memcpy(&stm_write_fcn_ram,
                      FCN_TO_VOID_PTR(stm_flash_write_doubleword_bank0),
                      MAX_WRITE_FCN_SIZE_BYTES);
        stm_flash_write_doubleword_bank0_ptr = VOID_PTR_TO_FCN_PTR(stm_write_fcn_ram);
    }
    else
    {
        APP_REQUIRE(false);
    }

    rutils_memcpy(&stm_erase_fcn_ram,
                  FCN_TO_VOID_PTR(stm_flash_erase_sector_bank0),
                  MAX_ERASE_FCN_SIZE_BYTES);

}

//!
//! @name      stm_flash_write
//!
//! @brief     Write string to STM flash
//!
//! @details   Interrupts will be disabled in 16usec (or so) chunks.
//!
//! @return    STM_FLASH_SUCCESS or STM_FLASH_FAILURE
//!
stm_flash_status_t stm_flash_write(uint8_t *address,
                                   uint8_t *data,
                                   unsigned data_length)
{
    stm_flash_status_t status;
    unsigned           bytes_written;

    // Sanity check to prevent crash
    if (stm_are_interrupts_disabled())
    {
        APP_REQUIRE(false);
        return STM_FLASH_FAILURE;
    }

    // Make sure all writes are within flash bank 0address space
    if (!stm_is_valid_address_bank0(address) ||
        ((data_length > 0)
        && !stm_is_valid_address_bank0(address + data_length - 1)))
    {
        APP_REQUIRE(false);
        return STM_FLASH_FAILURE;
    }

    stm_interrupt_disable();

    // Have we unlocked flash ops at any time? No--do it this once.
    if (!stm_unlocked)
    {
        stm_flash_unlock();
        stm_unlocked = true;
    }

    stm_interrupt_enable();

    // Step through writes according to pages.
    while (data_length > 0)
    {
        bytes_written = 0;

        status = stm_flash_page_write_bank0(address,
                                            data,
                                            data_length,
                                            &bytes_written,
                                            stm_voltage_level);
        if (STM_FLASH_SUCCESS != status)
        {
            return status;
        }

        // TBD: should we attempt a 2nd write if 1st fails?

        // Sanity check: let's not get stuck in a loop
        if (bytes_written == 0)
        {
            APP_ENSURE(bytes_written > 0);
            return STM_FLASH_FAILURE;
        }

        address += bytes_written;
        data += bytes_written;
        data_length -= bytes_written;
    }

    return STM_FLASH_SUCCESS;
}

//!
//! @name      stm_flash_erase
//!
//! @brief     Erase an STM flash sector
//!
//! @details   Interrupts will be disabled from 1/2 sec to
//! @details   several seconds during erasure.
//! @details   Use with discretion.
//!
//! @param[in] 'bank'- either 0 or 1 (1 is called "bank 2" in STM literature)
//! @param[in] 'sector_number'--
//!
//! @return    STM_FLASH_SUCCESS or STM_FLASH_FAILURE
//!
stm_flash_status_t stm_flash_erase(unsigned bank, uint16_t sector_number)
{
    uint32_t     status_reg;
    unsigned     psize;

    // Sanity check
    //if (bank0 > 1)
    // 2nd bank not supported yet
    if (bank > 0)
    {
        return STM_FLASH_FAILURE;
    }

    // Sanity check sector number
    if (sector_number >= ARRAY_SIZE(stm_layout))
    {
        APP_REQUIRE(false);
        return STM_FLASH_FAILURE;
    }

    // Convert to FLASH CR bits SNB, bits 6:3
    sector_number <<= 3;

    // Sanity check to prevent crash
    if (stm_are_interrupts_disabled())
    {
        APP_REQUIRE(false);
        return STM_FLASH_FAILURE;
    }

    // Make sure fcn. ptr is initialized
    APP_REQUIRE(NULL != stm_flash_erase_bank0_ptr);

    stm_interrupt_disable();

    // Have we unlocked flash ops at any time? No--do it this once.
    if (!stm_unlocked)
    {
        stm_flash_unlock();
        stm_unlocked = true;
    }

    stm_interrupt_enable();

    psize = stm_voltage_level_to_psize(stm_voltage_level);

    if (0 == bank)
    {
        // Have to lock interrupts, no choice
        // Get yourself a cup of coffee and a sandwich...
        stm_interrupt_disable();

        status_reg = (*stm_flash_erase_bank0_ptr)(sector_number, psize);

        stm_interrupt_enable();
    }
    else
    {
        // 2nd bank not supported yet
    }

    if (!FLASH_STATUS_OK(status_reg))
    {
        //TBD: check status, etc

        APP_ENSURE(false);
        return STM_FLASH_FAILURE;
    }

    return STM_FLASH_SUCCESS;
}
